xehp/hello_world_stm32/hello_stm32/src/serialDev.c
    /* 
    Activate the Pull-up or Pull down resistor for the current IO 
    00: No pull-up, pull-down (reset state for most IO pins)
    01: Pull-up
    10: Pull-down
    11: Reserved
    Seems resonable to activate Pull-up if open drain is used, but did not notice any improvement doing so.
    */
    const uint32_t pupd = 1U;
    tmp = GPIOA->PUPDR;
    tmp &= ~(3U << (pin * 2));
    tmp |= (pupd << (pin * 2));
    GPIOA->PUPDR = tmp;
}



USART_TypeDef *usartGetPtr(int usartNr)
{
    switch(usartNr)
    {
        case DEV_USART1: return USART1;
        #ifdef USART2_BAUDRATE
        case DEV_USART2: return USART2;
        #endif
        #ifdef USART3_BAUDRATE
        case DEV_USART3: return USART3;
        #endif
        default :
            sysErrorHandler(SYS_UNKNOWN_UART_ERROR);
            break;
	}
	return NULL;
}

int usartGetIrqN(int usartNr)
{
	switch(usartNr)
	{
		#ifdef LPUART1_BAUDRATE
		case DEV_LPUART1: return LPUART1_IRQn;
		#endif
		case DEV_USART1: return USART1_IRQn;
		#ifdef USART2_BAUDRATE
		case DEV_USART2: return USART2_IRQn;
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3: return USART3_IRQn;
		#endif
		default :
			sysErrorHandler(SYS_UNKNOWN_UART_ERROR);
			break;
	}
	return 0;
}


#ifdef LPUART1_BAUDRATE
int lpuartInit(uint32_t baud)
{

	/* Disable the Peripheral, should be the reset state but just in case. */
	LPUART1->CR1 &= ~USART_CR1_UE_Msk;

	/*
	USART1_TX on PA9, USART1_RX on PA10.
	But it is Usart2 that is connected to USB so using that one.
	USART2 GPIO Configuration: USART2_TX on PA2, USART2_RX on PA3
	*/

	// Clear the in and out FIFOs
	fifoInit(&lpuart1In);
	#ifdef LPUART1_TX_PIN
	fifoInit(&lpuart1Out);
	#endif

	// Enable Uart clock LPUART1EN
	RCC->APB1ENR2 |= RCC_APB1ENR2_LPUART1EN_Msk;

	#if LPUART1_BAUDRATE == 9600
	// Select clock LPUART1SEL
	{
	// [3] 6.4.27 Peripherals independent clock configuration register (RCC_CCIPR)
	// Bits 11:10 LPUART1SEL[1:0]: LPUART1 clock source selection
	// These bits are set and cleared by software to select the LPUART1 clock source.
	// 00: PCLK selected as LPUART1 clock
	// 01: System clock (SYSCLK) selected as LPUART1 clock
	// 10: HSI16 clock selected as LPUART1 clock
	// 11: LSE clock selected as LPUART1 clock
	uint32_t tmp = RCC->CCIPR;
	uint32_t sel = 2u;
	tmp &= ~(3 << RCC_CCIPR_LPUART1SEL_Pos);
	tmp |= (sel << RCC_CCIPR_LPUART1SEL_Pos);
	RCC->CCIPR = tmp;
	}
	#endif


	// Configure IO pins, to find pins and alternate function codes for STM32L432xx see table 17 in ref [2].
	// On Nucleo L432KC we use Serial2 on PA2 & PA15
	// So PA3 is free to use for LPUART1 but we have no transmit pin available.
	// TODO Use LPUART1 for receiving and SoftUart1 for transmitting.

	// Use PA2 for TX & PA3 for RX
	#if LPUART1_TX_PIN==2
	setupIoPinTx(GPIOA, 2, GPIO_AF8_LPUART1);
	#elif LPUART1_TX_PIN==11
	setupIoPinTx(GPIOB, 11, GPIO_AF8_LPUART1);
	#else
	#error
	#endif

	#if LPUART1_RX_PIN==3
	setupIoPinRx(GPIOA, 3, GPIO_AF8_LPUART1);
	#elif LPUART1_RX_PIN==10
	setupIoPinRx(GPIOB, 10, GPIO_AF8_LPUART1);
	#else
	#error
	#endif

	/*
	Select the desired baud rate using the USART_BRR register.
	https://community.st.com/thread/46664-setting-the-baudrate-for-usart-in-stm32f103rb
	Ref [1] chapter 36.5.4 USART baud rate generation
	*/
	#if LPUART1_BAUDRATE == 115200
	uint32_t clockDiv = 0x2B671;  // according to Table 203 in ref [3].
	#elif LPUART1_BAUDRATE == 38400
	uint32_t clockDiv = 0x82355;
	#elif LPUART1_BAUDRATE == 9600
	//uint32_t clockDiv = 0x369;  // according to Table 202 in ref [3].
	uint32_t clockDiv = 426667; // (256*16000000LL)/9600;
	#else
	#error
	#endif

	// LPUART1->BRR is a 20 bit register, no use setting larger than 0xfffff.
	// Less than 0x300 is not allowed according to [3] 39.4.4 LPUART baud rate generation
	if ((clockDiv<0x300) || (clockDiv>0xfffff))
	{
		return -1;
	}

	LPUART1->BRR = clockDiv;

	/* Enable uart transmitter and receiver */
	LPUART1->CR1 |= USART_CR1_TE_Msk | USART_CR1_RE_Msk;


	// Bit 1 UESM: USART enable in Stop mode
	// just testing, this should not be needed in this example.
	//LPUART1->CR1 |= USART_CR1_UESM_Msk;

	/*
	In asynchronous mode, the following bits must be kept cleared:
	- LINEN and CLKEN bits in the USART_CR2 register,
	- SCEN, HDSEL and IREN  bits in the USART_CR3 register.
	*/
	//LPUART1->CR2 &= ~(USART_CR2_LINEN_Msk | USART_CR2_CLKEN_Msk);
	//LPUART1->CR3 &= ~(USART_CR3_SCEN_Msk | USART_CR3_HDSEL_Msk | USART_CR3_IREN_Msk);
	LPUART1->CR2 &= ~(USART_CR2_CLKEN_Msk);



	//Set Usart1 interrupt priority. Lower number is higher priority.
	//uint32_t prioritygroup = NVIC_GetPriorityGrouping();
	//NVIC_SetPriority(USART2_IRQn, NVIC_EncodePriority(prioritygroup, 45, 0));
	const int irqN = usartGetIrqN(DEV_LPUART1);
	NVIC_SetPriority (irqN, (1UL << __NVIC_PRIO_BITS) - 1UL);

	// This one helped.
	// https://community.st.com/thread/19735
	// I was missing to do NVIC_EnableIRQ.
	NVIC_EnableIRQ(irqN);

	/* Enable the Peripheral */
	LPUART1->CR1 |= USART_CR1_UE_Msk;

	/*
	Shall interrupt be enabled before or after usart is enabled?
	Did not notice any difference doing this before or after.
	RXNEIE
	0: Interrupt is inhibited
	1: A USART interrupt is generated whenever ORE=1 or RXNE=1 in the USART_ISR
	*/
	LPUART1->CR1 |= USART_CR1_RXNEIE_Msk;

	return 0;
}
#endif

#ifdef USART1_BAUDRATE
static void setup_fifo_and_io_pins_usart1()
{
	fifoInit(&usart1In);
	fifoInit(&usart1Out);

	// If higher baud rate is needed change clock source.
	// Select clock LPUART1SEL
	/*{
	 uint32_t tmp = RCC->CCIPR;
	 tmp &= ~(3 << 0);
	 tmp |= ~(1 << 0);
	 RCC->CCIPR = tmp;
	 }*/
	//RCC->APB2RSTR |= RCC_APB2RSTR_USART1RST_Msk; // [RM0434] Bit 14 USART1RST: USART1 reset


	// Enable Usart1 device
	//#if (defined STM32L432xx)
	//RCC->APB2ENR1 |= RCC_APB2ENR1_USART1EN_Msk;
	//#elif (defined STM32L151xB) || (defined STM32F303x8) || (defined STM32F030x8)
	RCC->APB2ENR |= RCC_APB2ENR_USART1EN_Msk;
	//#else
	//#error Unknown device
	//#endif


	// Configure IO pins.
	#if (defined STM32F030x8)
	setupIoPinTx(GPIOA, 9, GPIO_AF1_USART1);
	setupIoPinRx(GPIOA, 10, GPIO_AF1_USART1);
	#elif 1
	// Using PA9/AF7 & PA10/AF7
	setupIoPinTx(GPIOA, 9, GPIO_AF7_USART1);
	setupIoPinRx(GPIOA, 10, GPIO_AF7_USART1);
	#else
	// See Ref [2] table 16 or Ref [5] table 10
	// If PA9 & PA10 are needed by something else try these instead:
	// Using PB6/AF7 & PB7/AF7
	setupIoPinTx(GPIOB, 6, GPIO_AF7_USART1);
	setupIoPinRx(GPIOB, 7, GPIO_AF7_USART1);
	#endif

