xehp/hello_world_stm32/hello_stm32/src/serialDev.c
}
#endif

#ifdef USART2_BAUDRATE
static void setup_fifo_and_io_pins_usart2()
{
	// Init FIFOs
	#ifdef USART2_RX_PIN
	fifoInit(&usart2In);
	#else
	#error
	#endif
	#ifdef USART2_TX_PIN
	fifoInit(&usart2Out);
	#else
	#error
	#endif

	// Enable Usart2 device
	#if (defined STM32L432xx)
	RCC->APB1ENR1 |= RCC_APB1ENR1_USART2EN_Msk;  // bit 17
	#elif (defined STM32L151xB) || (defined STM32F303x8) || (defined STM32F030x8)
	RCC->APB1ENR |= RCC_APB1ENR_USART2EN_Msk;
	#else
	#error Unknown device
	#endif

	// Setup transmit pin
	#ifdef USART2_TX_PIN
		#if USART2_TX_PIN == 2
			#if (defined STM32F030x8)
			setupIoPinTx(GPIOA, 2, GPIO_AF1_USART2);
			#else
			setupIoPinTx(GPIOA, 2, GPIO_AF7_USART2);
			#endif
		#elif (USART2_TX_PIN == 5) && (defined STM32L432xx)
		// Configure IO pins, to find pins and alternate function codes for STM32L432xx see table 16 in ref [2].
		// For STM32L151xB see table 10 in ref [5] to find which alternate function to use.
		setupIoPinTx(GPIOD, 5, GPIO_AF7_USART2);
		#else
		#error
		#endif
	#endif

	// Setup receive pin
	#ifdef USART2_RX_PIN
		#if USART2_RX_PIN == 3
			#if (defined STM32F0)
			// Want Usart2 RX on PA3 so its AF1
			setupIoPinRx(GPIOA, 3, GPIO_AF1_USART2);
			#else
			// Want Usart2 RX on PA3 so its AF7, ref [2] & [5] give same.
			setupIoPinRx(GPIOA, 3, GPIO_AF7_USART2);
			#endif
		#elif (USART2_RX_PIN == 6) && (defined STM32L432xx)
		// Want Usart2 RX on PD6 so its AF7
		setupIoPinRx(GPIOD, 3, GPIO_AF7_USART2);
		#elif (USART2_RX_PIN == 15) && (defined STM32L432xx)
		// Receive pin (normally it would be PA3 AF7, see ref [2].
		// But on Nucleo its not available so we need to use PA15 AF3.
		// Want Usart2 RX on PA15 so its AF3 (not AF7), see ref [2]. Not possible on STM32L151xB.
		setupIoPinRx(GPIOA, 15, GPIO_AF3_USART2);
		#else
		#error
		#endif
	#endif
}
#endif

#ifdef USART3_BAUDRATE
static void setup_fifo_and_io_pins_usart3()
{
	fifoInit(&usart3In);
	fifoInit(&usart3Out);

	RCC->APB1ENR |= RCC_APB1ENR_USART3EN_Msk;

	// For STM32L151xB see table 10 in ref [5].
	// Want Usart3 on TX=PB10 RX=PB11, so its AF7 for both.
	// It is also possible to use PC4, PC5, PC10, PC11 (all AF7) on some devices.
	// See table 16 in ref [2].

	// Transmit pin PB10/AF7
	setupIoPinTx(GPIOB, 10, GPIO_AF7_USART2);

	// Receive pin PB11/AF7
	setupIoPinRx(GPIOB, 11, GPIO_AF7_USART2);
}
#endif


#if (defined USART1_BAUDRATE) || (defined USART2_BAUDRATE) || (defined USART3_BAUDRATE)



/**
This sets up the Usart 1 or 2. 

USART1_TX on PA9, USART1_RX on PA10. 
Usart2 sends on USB (perhaps also on PA2), it receives on PA3.

Returns 0 if OK.
*/
static int initUsart123(int usartNr, uint32_t baud)
{
	USART_TypeDef *usartPtr = usartGetPtr(usartNr);
	if (usartPtr == NULL) 
	{
		return -1;
	}

	// Enable needed clocks
	// These lines should not be needed here.
	// TODO Investigate if there is a better place.
	#if (defined STM32L432xx)
	RCC->AHB2ENR |= RCC_AHB2ENR_GPIOAEN_Msk;
	#else
	RCC->AHBENR |= RCC_AHBENR_GPIOAEN_Msk;
	#endif

	/* Disable the Peripheral, should be the reset state but just in case. */
	//usartPtr->CR1 &= ~USART_CR1_UE_Msk;
	usartPtr->CR1 = 0;

	// Clear the in and out FIFOs
	// Enable Usart clock
	switch (usartNr)
	{
		#ifdef USART1_BAUDRATE
		case DEV_USART1:
			setup_fifo_and_io_pins_usart1();
			break;
		#endif
		#ifdef USART2_BAUDRATE
		case DEV_USART2:
			setup_fifo_and_io_pins_usart2();
			break;
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3:
			setup_fifo_and_io_pins_usart3();
			break;
		#endif
		default:
			return -1;
	}


	/*
	 [1] chapter 36.8.1 Control register 1 (USART_CR1)
	 36.8.12 USART register map
	 8-bit character length: M[1:0] = 00, that is default.
	 1 stop bit is the default value of number of stop bits.
	 That is what we want. So skipping those settings.
	 */

	/*
	 OVER8
	 0: Oversampling by 16 (default)
	 1: Oversampling by 8
	 */
	//usartPtr->CR1 |= (1 << 15);
	/*
	 Select the desired baud rate using the USART_BRR register.
	 https://community.st.com/thread/46664-setting-the-baudrate-for-usart-in-stm32f103rb
	 Ref [1] chapter 36.5.4 USART baud rate generation
	 */
	uint32_t divider = (SysClockFrequencyHz + (baud/2)) / baud;
	/*if (divider<0x300)
	 {
	 return -1;
	 }*/
	usartPtr->BRR = divider;

	/* Enable uart transmitter and receiver */
	usartPtr->CR1 |= USART_CR1_TE_Msk | USART_CR1_RE_Msk;

	// Bit 1 UESM: USART enable in Stop mode
	// just testing, this should not be needed in this example.
	//usartPtr->CR1 |= USART_CR1_UESM_Msk;

	// We may need to invert RX line if we use a simple optocoupler
	// That is done in CR2 Bit 16 RXINV like this:
	// usartPtr->CR2 |= USART_CR2_RXINV_Msk;
	// No we may need to invert TX line:
	// usartPtr->CR2 |= USART_CR2_TXINV_Msk;

	/*
	 In asynchronous mode, the following bits must be kept cleared:
	 - LINEN and CLKEN bits in the USART_CR2 register,
	 - SCEN, HDSEL and IREN  bits in the USART_CR3 register.
	 */
	//USART2->CR2 &= ~(USART_CR2_LINEN_Msk | USART_CR2_CLKEN_Msk);
	//USART2->CR3 &= ~(USART_CR3_SCEN_Msk | USART_CR3_HDSEL_Msk | USART_CR3_IREN_Msk);
	#ifndef STM32F030x8
	usartPtr->CR2 &= ~(USART_CR2_CLKEN_Msk);
	#endif

	sysBusyWait(2);

	//Set Usart1 interrupt priority. Lower number is higher priority.
	//uint32_t prioritygroup = NVIC_GetPriorityGrouping();
	//NVIC_SetPriority(USART2_IRQn, NVIC_EncodePriority(prioritygroup, 45, 0));
	const int irqN = usartGetIrqN(usartNr);
	NVIC_SetPriority(irqN, (1UL << __NVIC_PRIO_BITS) - 1UL);



	/* Enable the Peripheral */
	usartPtr->CR1 |= USART_CR1_UE_Msk;

	//sysLedFlashCode(SysMorseD);

	// Enable device specific interrupt
	NVIC_EnableIRQ(irqN);

	//sysLedFlashCode(SysMorseE);

	/*
	 Shall interrupt be enabled before or after usart is enabled?
	 Did not notice any difference doing this before or after.
	 RXNEIE
	 0: Interrupt is inhibited
	 1: A USART interrupt is generated whenever ORE=1 or RXNE=1 in the USART_ISR
	 */
	usartPtr->CR1 |= USART_CR1_RXNEIE_Msk;

	sysSleepMs(2);

	return 0;
}
#endif

// Returns zero if OK.
int serialInit(int usartNr, uint32_t baud)
{
	switch(usartNr)
	{
		#ifdef LPUART1_BAUDRATE
		case DEV_LPUART1: return lpuartInit(baud);
		#endif
		#ifdef USART1_BAUDRATE
		case DEV_USART1: return initUsart123(usartNr, baud);
		#endif
		#ifdef USART2_BAUDRATE
		case DEV_USART2: return initUsart123(usartNr, baud);
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3: return initUsart123(usartNr, baud);
		#endif
		default: break;
	}
	return -1;
}


#ifdef LPUART1_TX_PIN
static inline void lpuart1Put(int ch)
{
	fifoPut(&lpuart1Out, ch);
	LPUART1->CR1 |= USART_CR1_TXEIE_Msk;
}
#endif

#if (defined USART1_BAUDRATE)
static inline void usart1Put(int ch)
{
	fifoPut(&usart1Out, ch);
	/*
	Now we need to trigger the ISR. Its done by enabling transmitter empty interrupt (it is empty so).
	TXEIE
	0: Interrupt is inhibited
	1: A USART interrupt is generated whenever TXE=1 in the USART_ISR register
	*/
	USART1->CR1 |= USART_CR1_TXEIE_Msk;
}
#endif

#if (defined USART2_BAUDRATE) && (defined USART2_TX_PIN)
static inline void usart2Put(int ch)
{
	// If FIFO is full shall we wait or not?
	// Comment out lines below if not.
	//while (fifoIsFull(usart2Out))
	//{
	//	systemSleep();
	//}

#if 1
	fifoPut(&usart2Out, ch);
	// Now we need to trigger the ISR. Its done by enabling transmitter empty interrupt (it is empty so).
	USART2->CR1 |= USART_CR1_TXEIE_Msk;
#else
	USART2->TDR = ch;
	sysSleepMs(1);
#endif
}
#endif

#ifdef USART3_BAUDRATE
static inline void usart3Put(int ch)
{
	// If FIFO is full shall we wait or not?
	// Comment out lines below if not.
	//while (fifoIsFull(usart3Out))
	//{
	//	systemSleep();
	//}

