xehp/hello_world_stm32/hello_stm32/src/serialDev.c
	fifoPut(&usart3Out, ch);
	// Now we need to trigger the ISR. Its done by enabling transmitter empty interrupt (it is empty so).
	USART3->CR1 |= USART_CR1_TXEIE_Msk;
}
#endif


// Ref [1] chapter 36.5.2 USART transmitter
void serialPutChar(int usartNr, int ch)
{
	switch(usartNr)
	{
		#ifdef LPUART1_TX_PIN
		case DEV_LPUART1:
			lpuart1Put(ch);
			break;
		#endif
		#ifdef USART1_BAUDRATE
		case DEV_USART1:
			usart1Put(ch);
			break;
		#endif
		#ifdef USART2_BAUDRATE
		case DEV_USART2:
			#ifdef USART2_TX_PIN
			usart2Put(ch);
			#endif
			break;
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3:
			usart3Put(ch);
			break;
		#endif
		default:
			// Ignore this.
		break;
	}
}

int serialGetChar(int usartNr)
{
	switch(usartNr)
	{
		#ifdef LPUART1_BAUDRATE
		case DEV_LPUART1:
			if (!fifoIsEmpty(&lpuart1In))
			{
				return fifoTake(&lpuart1In);
			}
			return -1;
		#endif
		#if (defined USART1_BAUDRATE)
		case DEV_USART1:
			if (!fifoIsEmpty(&usart1In))
			{
				return fifoTake(&usart1In);
			}
			return -1;
		#endif
		#if (defined USART2_BAUDRATE) && (defined USART2_RX_PIN)
		case DEV_USART2:
			if (!fifoIsEmpty(&usart2In))
			{
				return fifoTake(&usart2In);
			}
			return -1;
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3:
			if (!fifoIsEmpty(&usart3In))
			{
				return fifoTake(&usart3In);
			}
			return -1;
		#endif
		default:
			return -1;
		break;
	}
}

#ifdef LPUART1_TX_PIN
static inline void usartWriteLpuart1(const char *str, int msgLen)
{
	while (msgLen>0)
	{
		lpuart1Put(*str++);
	    msgLen--;
	}
}
#endif

#if (defined USART1_BAUDRATE)
static inline void usartWriteUart1(const char *str, int msgLen)
{
	while (msgLen>0)
	{
		usart1Put(*str++);
	    msgLen--;
	}
}
#endif

#ifdef USART2_BAUDRATE
static inline void usartWriteUart2(const char *str, int msgLen)
{
	#ifdef USART2_TX_PIN
	while (msgLen>0)
	{
		usart2Put(*str++);
	    msgLen--;
	}
	#endif
}
#endif

#ifdef USART3_BAUDRATE
static inline void usartWriteUart3(const char *str, int msgLen)
{
	while (msgLen>0)
	{
		usart3Put(*str++);
	    msgLen--;
	}
}
#endif


void serialWrite(int usartNr, const char *str, int msgLen)
{
	switch(usartNr)
	{
		#ifdef LPUART1_TX_PIN
		case DEV_LPUART1:
			usartWriteLpuart1(str, msgLen);
			break;
		#endif
		#if (defined USART1_BAUDRATE)
		case DEV_USART1:
			usartWriteUart1(str, msgLen);
			break;
		#endif
		#ifdef USART2_BAUDRATE
		case DEV_USART2:
			usartWriteUart2(str, msgLen);
			break;
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3:
			usartWriteUart3(str, msgLen);
			break;
		#endif
		default:
			/*
			while (msgLen>0)
			{
			    serialPutChar(usartNr, *str++);
			    msgLen--;
			}
			*/
			// ignore this
			break;
	}
}

void serialPrint(int usartNr, const char *str)
{
	while(*str)
	{
		serialPutChar(usartNr, *str++);
	}
}

void serialPrintInt32(int usartNr, int32_t num)
{
	char str[64];
	misc_lltoa(num, str, 10);
	serialPrint(usartNr, str);
}

int serialGetFreeSpaceWriteBuffer(int usartNr)
{
	switch(usartNr)
	{
		#if (defined LPUART1_BAUDRATE) && (defined LPUART1_TX_PIN)
		case DEV_LPUART1:
			fifoPut(&lpuart1Out, ch);
			return fifo_free_space(&usart1Out);
		#endif
		#if (defined USART1_BAUDRATE)
		case DEV_USART1:
			return fifo_free_space(&usart1Out);
		#endif
		#if (defined USART2_BAUDRATE) && (defined USART2_TX_PIN)
		case DEV_USART2:
			return fifo_free_space(&usart2Out);
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3:
			return fifo_free_space(&usart3Out);
		#endif
		default:
			// Ignore this.
		break;
	}
	return 0;
}


static const int hex[]={'0','1','2','3','4','5','6','7', '8','9','A','B','C','D','E','F'};

void serialPrintHex4(int usartNr, uint8_t i)
{
	serialPutChar(usartNr, hex[i&0xf]);
}

void serialPrintHex8(int usartNr, uint8_t i)
{
	serialPrintHex4(usartNr, i>>4);
	serialPrintHex4(usartNr, i&0xf);
}

void serialPrintHex16(int usartNr, uint16_t i)
{
	serialPrintHex8(usartNr, i>>8);
	serialPrintHex8(usartNr, i&0xff);
}

void serialPrintHex32(int usartNr, uint32_t i)
{
	serialPrintHex16(usartNr, i>>16);
	serialPrintHex16(usartNr, i&0xffff);
}


